app/controllers/fixtures_controller.rb

SELECT  "fixtures".* FROM "fixtures" ORDER BY "fixtures"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @fixtures = Fixture.all

SELECT  "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @fixture = Fixture.find(params[:id])