app/controllers/games_controller.rb

INSERT INTO "fixtures" ("home_team_id", "away_team_id", "stadium_id", "season_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["home_team_id", 19], ["away_team_id", 12], ["stadium_id", 19], ["season_id", 1], ["created_at", "2019-09-27 19:25:49.023593"], ["updated_at", "2019-09-27 19:25:49.023593"]]
---
  def show

    @thedate = params[:id]

    # Code test with an API call • "Ligue 1" league is 525
    ####################################
    # Game IDs recovery based on date
    ####################################

    # today = Time.now.strftime("%Y-%m-%d")
    # friday20190920 = "2019-09-20" #Only one game as been played that date

    url = URI("https://api-football-v1.p.rapidapi.com/v2/fixtures/league/525/#{@thedate}")
    jsonresponse = api_call(url)
    fixtures_list = JSON.parse(jsonresponse)

    fix_list_hash = fixtures_list["api"]["fixtures"]

    games_array = []

    fix_list_hash.each do |game|
        if game["status"] == "Match Finished"
            games_array << game["fixture_id"]

INSERT INTO "fixtures" ("home_team_id", "away_team_id", "stadium_id", "season_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["home_team_id", 19], ["away_team_id", 12], ["stadium_id", 19], ["season_id", 1], ["created_at", "2019-09-27 19:38:57.755674"], ["updated_at", "2019-09-27 19:38:57.755674"]]
---
        #Check what's needed to create a fixture
        #and also all its events!

        newgame = Fixture.create(home_team: Team.where(city:fetchgoodteamname(fix_events_hash["homeTeam"]["team_name"]))[0], away_team: Team.where(city:fetchgoodteamname(fix_events_hash["awayTeam"]["team_name"]))[0], stadium: Stadium.where(town:fetchgoodteamname(fix_events_hash["homeTeam"]["team_name"]))[0], season: Season.last)