app/controllers/pages_controller.rb

  def home
    @fixtures = Fixture.all
---
SELECT "fixtures".* FROM "fixtures"