app/controllers/teams_controller.rb

  def index
    @teams = Team.all
---
SELECT  "teams".* FROM "teams" ORDER BY "teams"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def show
    @team = Team.find(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]